'use babel'

export const errors = [
    'JOpa',    //0
    'Не найден оператор sinumerik',   // 1
    'Ошибка при разборе условия IF-GOTO',   //  2
    'Применен оператор ROUND или TRUNC',  // NC   3
    'Между условиями нераспознанный оператор', //  4
    'Ошибка при разборе условия IF-ELSE',     //    5
    'Не найден ENDIF',                        //   6
    'Центр окружности в относительных координатах пока не работает', //   7
    'Номера кромок D без T, не поддерживаются в NC',         //8
    'Конечная точка или текущая позиция заданы выражением (R-переменной)',    //9

]