'use babel'

export const errors = [
    'Jopa',    //0
    'Не найден оператор sinumerik',   // 1
    'Ошибка при разборе условия IF-GOTO',   //  2
    'Применен оператор ROUND или POT',  // NC   3
    'Между условиями нераспознанный оператор', //  4
    'Ошибка при разборе условия IF-ELSE',     //    5
    'Не найден ENDIF',                        //   6
    'Центр окружности в относительных координатах пока не работает', //   7
    'Номера кромок D без T, не поддерживаются',         //8
    'Конечная точка или текущая позиция заданы выражением (R-переменной)',    //9
    'Ошибка в значении координаты', //10
    'Цель перехода GOTO не найдена', //11
    'Цели перехода GOTO дублируются', //12
    'Не найдена замена', //13
    'Вызов подпрограммы еще не поддерживается для NC', //14
    'Невозможно определить g-code type. Применен type A', //15
]